W6D3/first_rc_project/app/controllers/artwork_shares_controller.rb

    def create
        @artwork_share = ArtworkShare.new(artwork_share_params)
        if @artwork_share.save
---
INSERT INTO "artwork_shares" ("artwork_id", "viewer_id") VALUES ($1, $2) RETURNING "id"  [["artwork_id", 2], ["viewer_id", 1]]

    def destroy
        @artwork_share = ArtworkShare.find(params[:id]) # use this pattern whenever we need to retrieve a bubble using id wildcard

        @artwork_share.destroy
---
SELECT  "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 5]]