W6D3/first_rc_project/app/controllers/artworks_controller.rb

SELECT "artworks".* FROM "artworks"
---
    def index

        if params.has_key?(:user_id)
            #when we open rails routes we can see this associated
            #user_id key is included now
           #artworks and shared_artworks
            @user = User.find(params[:user_id])
            @artworks = @user.artworks + @user.shared_artworks
        else
            @artworks = Artwork.all