W6D3/first_rc_project/app/controllers/users_controller.rb

    def index
         # This action uses query string parameters because it gets run
  # by an HTTP GET request, but this does not make any difference
  # to the way in which the parameters are accessed. The URL for
  # this action would look like this in order to list activated
        #local host:3000/users/query='rossmiglin@gmail.com'
        if User.find(params[:query])
            @users = User.find(params[:query])
        else
            @users = User.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
SELECT "users".* FROM "users"

    def create
        @user = User.new(user_params)

        # replace the `user_attributes_here` with the actual attribute keys
        #will eventually use a helper strong params method
        if @user.save
---
INSERT INTO "users" ("created_at", "updated_at", "username") VALUES ($1, $2, $3) RETURNING "id"  [["created_at", "2020-08-13 19:08:47.610286"], ["updated_at", "2020-08-13 19:08:47.610286"], ["username", "rich_is_my_fave@email.com"]]

    def destroy
     @user = User.find(params[:id]) # use this pattern whenever we need to retrieve a bubble using id wildcard

     @user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 5]]