W8D1/RedditClone/RedditClone/app/controllers/subs_controller.rb

    def create
        @sub = Sub.new(sub_params)
        @sub.user_id = current_user.id
        if @sub.save
---
INSERT INTO "subs" ("title", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Ask Reddit"], ["description", "AMA Redditors"], ["user_id", 1], ["created_at", "2020-08-24 20:58:12.885217"], ["updated_at", "2020-08-24 20:58:12.885217"]]