W8D1/RedditClone/RedditClone/app/models/user.rb

    def self.find_by_credentials(usr,pw)
        user = User.find_by(username: usr)
---
SELECT  "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "kevin"], ["LIMIT", 1]]