W8D1/RedditClone/RedditClone/app/views/users/show.html.erb

SELECT "subs".* FROM "subs" WHERE "subs"."user_id" = ?  [["user_id", 1]]
---
<ul>
    <%@user.subs.each do |sub|%>